--- crates/velt-engine/src/amort.rs
+++ replace remaining_balance -> Result<Money> with Ok(Default::default())
@@ -165,70 +165,17 @@
 /// # Errors
 /// [`MoneyError::Overflow`] or [`MoneyError::NonPositive`].
 pub fn remaining_balance(
     principal: Money,
     annual_rate: Bps,
     term_months: u32,
     elapsed_months: u32,
 ) -> Result<Money> {
-    if elapsed_months >= term_months {
-        return Ok(Money::zero(principal.currency()));
-    }
-    let payment = monthly_payment(principal, annual_rate, term_months)?;
-    let rate_fp = monthly_rate_fp(annual_rate)?;
-
-    if rate_fp == 0 {
-        let paid = payment.mul_int(i64::from(elapsed_months))?;
-        return principal.sub(paid);
-    }
-
-    let one_plus = SCALE.checked_add(rate_fp).ok_or(MoneyError::Overflow {
-        op: "amort::one_plus",
-    })?;
-    let growth = pow_fp(one_plus, elapsed_months)?;
-    let growth_less_one = growth.checked_sub(SCALE).ok_or(MoneyError::Overflow {
-        op: "amort::balance",
-    })?;
-
-    // balance = L*(1+r)^k - P*((1+r)^k - 1)/r
-    //
-    // Both terms are put over the common denominator SCALE*r and rounded once.
-    // Rounding each term separately admits +/-1 cent of error, which is exactly
-    // the kind of quiet drift doctrine §2 calls worse than useless.
-    let grown = i128::from(principal.minor())
-        .checked_mul(growth)
-        .ok_or(MoneyError::Overflow {
-            op: "amort::balance",
-        })?
-        .checked_mul(rate_fp)
-        .ok_or(MoneyError::Overflow {
-            op: "amort::balance",
-        })?;
-    let repaid = i128::from(payment.minor())
-        .checked_mul(growth_less_one)
-        .ok_or(MoneyError::Overflow {
-            op: "amort::balance",
-        })?
-        .checked_mul(SCALE)
-        .ok_or(MoneyError::Overflow {
-            op: "amort::balance",
-        })?;
-    let numer = grown.checked_sub(repaid).ok_or(MoneyError::Overflow {
-        op: "amort::balance",
-    })?;
-    let denom = SCALE.checked_mul(rate_fp).ok_or(MoneyError::Overflow {
-        op: "amort::balance",
-    })?;
-
-    let minor = div_round_half_away(numer, denom)?;
-    let minor = i64::try_from(minor).map_err(|_| MoneyError::Overflow {
-        op: "amort::balance",
-    })?;
-    Ok(Money::from_minor(minor.max(0), principal.currency()))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Loan principal implied by a purchase price and a down payment rate.
 ///
 /// # Errors
 /// [`MoneyError::Overflow`].
 pub fn principal_from_ltv(price: Money, down_payment_rate: Bps) -> Result<Money> {
     let down = price.apply(down_payment_rate)?;
