--- crates/velt-engine/src/amort.rs
+++ replace principal_from_ltv -> Result<Money> with Ok(Default::default())
@@ -226,18 +226,17 @@
     Ok(Money::from_minor(minor.max(0), principal.currency()))
 }
 
 /// Loan principal implied by a purchase price and a down payment rate.
 ///
 /// # Errors
 /// [`MoneyError::Overflow`].
 pub fn principal_from_ltv(price: Money, down_payment_rate: Bps) -> Result<Money> {
-    let down = price.apply(down_payment_rate)?;
-    price.sub(down)
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Convenience: USD zero.
 #[must_use]
 pub const fn usd_zero() -> Money {
     Money::zero(Currency::Usd)
 }
 
