--- crates/velt-engine/src/amort.rs
+++ replace mul_fp -> Result<i128> with Ok(1)
@@ -15,22 +15,17 @@
 
 /// Months in a year.
 pub const MONTHS_PER_YEAR: i64 = 12;
 
 type Result<T> = std::result::Result<T, MoneyError>;
 
 /// Multiply two fixed-point values.
 fn mul_fp(a: i128, b: i128) -> Result<i128> {
-    let product = a.checked_mul(b).ok_or(MoneyError::Overflow {
-        op: "amort::mul_fp",
-    })?;
-    product.checked_div(SCALE).ok_or(MoneyError::Overflow {
-        op: "amort::mul_fp",
-    })
+    Ok(1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Raise a fixed-point base to an integer power by binary exponentiation.
 fn pow_fp(base: i128, exp: u32) -> Result<i128> {
     let mut result = SCALE;
     let mut base = base;
     let mut exp = exp;
     while exp > 0 {
