--- crates/velt-engine/src/amort.rs
+++ replace usd_zero -> Money with Default::default()
@@ -233,17 +233,17 @@
 pub fn principal_from_ltv(price: Money, down_payment_rate: Bps) -> Result<Money> {
     let down = price.apply(down_payment_rate)?;
     price.sub(down)
 }
 
 /// Convenience: USD zero.
 #[must_use]
 pub const fn usd_zero() -> Money {
-    Money::zero(Currency::Usd)
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn usd(minor: i64) -> Money {
         Money::from_minor(minor, Currency::Usd)
