--- crates/velt-engine/src/amort.rs
+++ replace >>= with <<= in pow_fp
@@ -32,17 +32,17 @@
 fn pow_fp(base: i128, exp: u32) -> Result<i128> {
     let mut result = SCALE;
     let mut base = base;
     let mut exp = exp;
     while exp > 0 {
         if exp & 1 == 1 {
             result = mul_fp(result, base)?;
         }
-        exp >>= 1;
+        exp <<= /* ~ changed by cargo-mutants ~ */ 1;
         if exp > 0 {
             base = mul_fp(base, base)?;
         }
     }
     Ok(result)
 }
 
 /// Integer division rounding half away from zero.
