--- crates/velt-engine/src/amort.rs
+++ replace > with == in pow_fp
@@ -33,17 +33,17 @@
     let mut result = SCALE;
     let mut base = base;
     let mut exp = exp;
     while exp > 0 {
         if exp & 1 == 1 {
             result = mul_fp(result, base)?;
         }
         exp >>= 1;
-        if exp > 0 {
+        if exp == /* ~ changed by cargo-mutants ~ */ 0 {
             base = mul_fp(base, base)?;
         }
     }
     Ok(result)
 }
 
 /// Integer division rounding half away from zero.
 fn div_round_half_away(numer: i128, denom: i128) -> Result<i128> {
