--- crates/velt-engine/src/amort.rs
+++ replace div_round_half_away -> Result<i128> with Ok(-1)
@@ -42,40 +42,17 @@
             base = mul_fp(base, base)?;
         }
     }
     Ok(result)
 }
 
 /// Integer division rounding half away from zero.
 fn div_round_half_away(numer: i128, denom: i128) -> Result<i128> {
-    if denom == 0 {
-        return Err(MoneyError::DivideByZero { op: "amort::div" });
-    }
-    // checked_div/checked_rem rather than `/` and `%`: i128::MIN / -1 overflows,
-    // and doctrine §5 does not permit a financial path that can panic.
-    let quot = numer
-        .checked_div(denom)
-        .ok_or(MoneyError::Overflow { op: "amort::div" })?;
-    let rem = numer
-        .checked_rem(denom)
-        .ok_or(MoneyError::Overflow { op: "amort::div" })?;
-    if rem == 0 {
-        return Ok(quot);
-    }
-    let twice = rem
-        .checked_mul(2)
-        .ok_or(MoneyError::Overflow { op: "amort::div" })?;
-    if twice.abs() >= denom.abs() {
-        let step = if (numer < 0) == (denom < 0) { 1 } else { -1 };
-        quot.checked_add(step)
-            .ok_or(MoneyError::Overflow { op: "amort::div" })
-    } else {
-        Ok(quot)
-    }
+    Ok(-1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The periodic (monthly) rate as fixed point, from an annual nominal rate.
 fn monthly_rate_fp(annual: Bps) -> Result<i128> {
     let numer = i128::from(annual.raw())
         .checked_mul(SCALE)
         .ok_or(MoneyError::Overflow {
             op: "amort::monthly_rate",
