--- crates/velt-engine/src/amort.rs
+++ replace == with != in div_round_half_away
@@ -53,17 +53,17 @@
     // checked_div/checked_rem rather than `/` and `%`: i128::MIN / -1 overflows,
     // and doctrine §5 does not permit a financial path that can panic.
     let quot = numer
         .checked_div(denom)
         .ok_or(MoneyError::Overflow { op: "amort::div" })?;
     let rem = numer
         .checked_rem(denom)
         .ok_or(MoneyError::Overflow { op: "amort::div" })?;
-    if rem == 0 {
+    if rem != /* ~ changed by cargo-mutants ~ */ 0 {
         return Ok(quot);
     }
     let twice = rem
         .checked_mul(2)
         .ok_or(MoneyError::Overflow { op: "amort::div" })?;
     if twice.abs() >= denom.abs() {
         let step = if (numer < 0) == (denom < 0) { 1 } else { -1 };
         quot.checked_add(step)
