--- crates/velt-engine/src/amort.rs
+++ replace < with <= in div_round_half_away
@@ -60,17 +60,17 @@
         .ok_or(MoneyError::Overflow { op: "amort::div" })?;
     if rem == 0 {
         return Ok(quot);
     }
     let twice = rem
         .checked_mul(2)
         .ok_or(MoneyError::Overflow { op: "amort::div" })?;
     if twice.abs() >= denom.abs() {
-        let step = if (numer < 0) == (denom < 0) { 1 } else { -1 };
+        let step = if (numer < 0) == (denom <= /* ~ changed by cargo-mutants ~ */ 0) { 1 } else { -1 };
         quot.checked_add(step)
             .ok_or(MoneyError::Overflow { op: "amort::div" })
     } else {
         Ok(quot)
     }
 }
 
 /// The periodic (monthly) rate as fixed point, from an annual nominal rate.
