--- crates/velt-engine/src/amort.rs
+++ replace monthly_rate_fp -> Result<i128> with Ok(-1)
@@ -70,29 +70,17 @@
             .ok_or(MoneyError::Overflow { op: "amort::div" })
     } else {
         Ok(quot)
     }
 }
 
 /// The periodic (monthly) rate as fixed point, from an annual nominal rate.
 fn monthly_rate_fp(annual: Bps) -> Result<i128> {
-    let numer = i128::from(annual.raw())
-        .checked_mul(SCALE)
-        .ok_or(MoneyError::Overflow {
-            op: "amort::monthly_rate",
-        })?;
-    let denom = i128::from(Bps::SCALE)
-        .checked_mul(i128::from(MONTHS_PER_YEAR))
-        .ok_or(MoneyError::Overflow {
-            op: "amort::monthly_rate",
-        })?;
-    numer.checked_div(denom).ok_or(MoneyError::Overflow {
-        op: "amort::monthly_rate",
-    })
+    Ok(-1) /* ~ changed by cargo-mutants ~ */
 }
 
 /// The level monthly payment that fully amortizes `principal` over `term_months`
 /// at annual nominal rate `annual_rate`, compounded monthly.
 ///
 /// A zero rate degrades to straight-line principal repayment rather than
 /// dividing by zero.
 ///
