--- crates/velt-engine/src/lib.rs
+++ delete ! in underwrite
@@ -169,17 +169,17 @@
 /// provenance tree.
 ///
 /// # Errors
 /// [`EngineError::InvalidInput`] if an input violates a modelling precondition,
 /// or [`EngineError::Money`] on overflow or currency mismatch.
 pub fn underwrite(inputs: &UnderwriteInputs, traced: &TracedInputs) -> Result<Underwrite> {
     let currency = inputs.currency();
 
-    if !inputs.deal.purchase_price.is_positive() {
+    if  /* ~ changed by cargo-mutants ~ */inputs.deal.purchase_price.is_positive() {
         return Err(EngineError::InvalidInput {
             field: "purchase_price",
             detail: "must be greater than zero",
         });
     }
     if inputs.income.vacancy_rate.raw() < 0 || inputs.income.vacancy_rate >= Bps::ONE {
         return Err(EngineError::InvalidInput {
             field: "vacancy_rate",
