--- crates/velt-money/src/lib.rs
+++ replace Currency::code -> &'static str with "xyzzy"
@@ -94,23 +94,17 @@
             3 => 1_000,
             _ => 1_000,
         }
     }
 
     /// ISO-4217 alphabetic code.
     #[must_use]
     pub const fn code(self) -> &'static str {
-        match self {
-            Self::Usd => "USD",
-            Self::Eur => "EUR",
-            Self::Gbp => "GBP",
-            Self::Cad => "CAD",
-            Self::Mxn => "MXN",
-        }
+        "xyzzy" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 impl fmt::Display for Currency {
     fn fmt(&self, f: &mut fmt::Formatter<'_>) -> fmt::Result {
         f.write_str(self.code())
     }
 }
