--- crates/velt-money/src/lib.rs
+++ replace Money::from_major -> Result<Self> with Ok(Default::default())
@@ -136,20 +136,17 @@
     }
 
     /// Construct from whole major units (dollars).
     ///
     /// # Errors
     /// Returns [`MoneyError::Overflow`] if the amount does not fit in `i64`
     /// minor units.
     pub fn from_major(major: i64, currency: Currency) -> Result<Self> {
-        let minor = major
-            .checked_mul(currency.minor_units_per_major())
-            .ok_or(MoneyError::Overflow { op: "from_major" })?;
-        Ok(Self { minor, currency })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Zero in the given currency.
     #[must_use]
     pub const fn zero(currency: Currency) -> Self {
         Self { minor: 0, currency }
     }
 
