--- crates/velt-money/src/lib.rs
+++ replace Money::zero -> Self with Default::default()
@@ -145,17 +145,17 @@
             .checked_mul(currency.minor_units_per_major())
             .ok_or(MoneyError::Overflow { op: "from_major" })?;
         Ok(Self { minor, currency })
     }
 
     /// Zero in the given currency.
     #[must_use]
     pub const fn zero(currency: Currency) -> Self {
-        Self { minor: 0, currency }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// The raw minor-unit amount.
     #[must_use]
     pub const fn minor(self) -> i64 {
         self.minor
     }
 
