--- crates/velt-money/src/lib.rs
+++ replace Money::minor -> i64 with 1
@@ -151,17 +151,17 @@
     #[must_use]
     pub const fn zero(currency: Currency) -> Self {
         Self { minor: 0, currency }
     }
 
     /// The raw minor-unit amount.
     #[must_use]
     pub const fn minor(self) -> i64 {
-        self.minor
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// The currency tag.
     #[must_use]
     pub const fn currency(self) -> Currency {
         self.currency
     }
 
