--- crates/velt-money/src/lib.rs
+++ replace == with != in Money::is_zero
@@ -163,17 +163,17 @@
     #[must_use]
     pub const fn currency(self) -> Currency {
         self.currency
     }
 
     /// True if the amount is exactly zero.
     #[must_use]
     pub const fn is_zero(self) -> bool {
-        self.minor == 0
+        self.minor != /* ~ changed by cargo-mutants ~ */ 0
     }
 
     /// True if the amount is strictly greater than zero.
     #[must_use]
     pub const fn is_positive(self) -> bool {
         self.minor > 0
     }
 
