--- crates/velt-money/src/lib.rs
+++ replace > with == in Money::is_positive
@@ -169,17 +169,17 @@
     #[must_use]
     pub const fn is_zero(self) -> bool {
         self.minor == 0
     }
 
     /// True if the amount is strictly greater than zero.
     #[must_use]
     pub const fn is_positive(self) -> bool {
-        self.minor > 0
+        self.minor == /* ~ changed by cargo-mutants ~ */ 0
     }
 
     /// True if the amount is strictly less than zero.
     #[must_use]
     pub const fn is_negative(self) -> bool {
         self.minor < 0
     }
 
