--- crates/velt-money/src/lib.rs
+++ replace Money::is_positive -> bool with false
@@ -169,17 +169,17 @@
     #[must_use]
     pub const fn is_zero(self) -> bool {
         self.minor == 0
     }
 
     /// True if the amount is strictly greater than zero.
     #[must_use]
     pub const fn is_positive(self) -> bool {
-        self.minor > 0
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     /// True if the amount is strictly less than zero.
     #[must_use]
     pub const fn is_negative(self) -> bool {
         self.minor < 0
     }
 
