--- crates/velt-money/src/lib.rs
+++ replace == with != in Money::same_currency
@@ -179,17 +179,17 @@
 
     /// True if the amount is strictly less than zero.
     #[must_use]
     pub const fn is_negative(self) -> bool {
         self.minor < 0
     }
 
     fn same_currency(self, rhs: Self) -> Result<()> {
-        if self.currency == rhs.currency {
+        if self.currency != /* ~ changed by cargo-mutants ~ */ rhs.currency {
             Ok(())
         } else {
             Err(MoneyError::CurrencyMismatch {
                 lhs: self.currency,
                 rhs: rhs.currency,
             })
         }
     }
