--- crates/velt-money/src/lib.rs
+++ replace Money::same_currency -> Result<()> with Ok(())
@@ -179,24 +179,17 @@
 
     /// True if the amount is strictly less than zero.
     #[must_use]
     pub const fn is_negative(self) -> bool {
         self.minor < 0
     }
 
     fn same_currency(self, rhs: Self) -> Result<()> {
-        if self.currency == rhs.currency {
-            Ok(())
-        } else {
-            Err(MoneyError::CurrencyMismatch {
-                lhs: self.currency,
-                rhs: rhs.currency,
-            })
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checked addition. Currencies must match.
     ///
     /// # Errors
     /// [`MoneyError::CurrencyMismatch`] or [`MoneyError::Overflow`].
     /// Not `std::ops::Add`: that trait is infallible, and money addition here
     /// can fail on currency mismatch or overflow. Doctrine §5 forbids money
