--- crates/velt-money/src/lib.rs
+++ replace Money::sub -> Result<Self> with Ok(Default::default())
@@ -218,25 +218,17 @@
     ///
     /// # Errors
     /// [`MoneyError::CurrencyMismatch`] or [`MoneyError::Overflow`].
     /// Not `std::ops::Add`: that trait is infallible, and money addition here
     /// can fail on currency mismatch or overflow. Doctrine §5 forbids money
     /// arithmetic that cannot report being wrong.
     #[allow(clippy::should_implement_trait)]
     pub fn sub(self, rhs: Self) -> Result<Self> {
-        self.same_currency(rhs)?;
-        let minor = self
-            .minor
-            .checked_sub(rhs.minor)
-            .ok_or(MoneyError::Overflow { op: "sub" })?;
-        Ok(Self {
-            minor,
-            currency: self.currency,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checked negation.
     ///
     /// # Errors
     /// [`MoneyError::Overflow`] at `i64::MIN`.
     /// Not `std::ops::Add`: that trait is infallible, and money addition here
     /// can fail on currency mismatch or overflow. Doctrine §5 forbids money
