--- crates/velt-money/src/lib.rs
+++ replace Money::neg -> Result<Self> with Ok(Default::default())
@@ -238,24 +238,17 @@
     ///
     /// # Errors
     /// [`MoneyError::Overflow`] at `i64::MIN`.
     /// Not `std::ops::Add`: that trait is infallible, and money addition here
     /// can fail on currency mismatch or overflow. Doctrine §5 forbids money
     /// arithmetic that cannot report being wrong.
     #[allow(clippy::should_implement_trait)]
     pub fn neg(self) -> Result<Self> {
-        let minor = self
-            .minor
-            .checked_neg()
-            .ok_or(MoneyError::Overflow { op: "neg" })?;
-        Ok(Self {
-            minor,
-            currency: self.currency,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Multiply by an integer scalar (e.g. 12 months).
     ///
     /// # Errors
     /// [`MoneyError::Overflow`].
     pub fn mul_int(self, n: i64) -> Result<Self> {
         let minor = self
