--- crates/velt-money/src/lib.rs
+++ replace Money::sum -> Result<Self> with Ok(Default::default())
@@ -268,19 +268,17 @@
         })
     }
 
     /// Sum an iterator of amounts, requiring a currency for the empty case.
     ///
     /// # Errors
     /// [`MoneyError::CurrencyMismatch`] or [`MoneyError::Overflow`].
     pub fn sum<I: IntoIterator<Item = Self>>(items: I, currency: Currency) -> Result<Self> {
-        items
-            .into_iter()
-            .try_fold(Self::zero(currency), |acc, item| acc.add(item))
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Apply a rate, rounding half-away-from-zero to the nearest minor unit.
     ///
     /// This is the single rounding policy in VELT. It is applied once, here, so
     /// that a rounding change is a one-line diff with one snapshot-test delta
     /// rather than a hunt through the engine.
     ///
