--- crates/velt-money/src/lib.rs
+++ replace Money::apply -> Result<Self> with Ok(Default::default())
@@ -283,26 +283,17 @@
     /// This is the single rounding policy in VELT. It is applied once, here, so
     /// that a rounding change is a one-line diff with one snapshot-test delta
     /// rather than a hunt through the engine.
     ///
     /// # Errors
     /// [`MoneyError::Overflow`] if the intermediate product exceeds `i128`
     /// range or the result exceeds `i64`.
     pub fn apply(self, rate: Bps) -> Result<Self> {
-        let numer = i128::from(self.minor)
-            .checked_mul(i128::from(rate.raw()))
-            .ok_or(MoneyError::Overflow { op: "apply" })?;
-        let denom = i128::from(Bps::SCALE);
-        let minor = div_round_half_away(numer, denom)?;
-        let minor = i64::try_from(minor).map_err(|_| MoneyError::Overflow { op: "apply" })?;
-        Ok(Self {
-            minor,
-            currency: self.currency,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Divide by an integer scalar, rounding half-away-from-zero.
     ///
     /// # Errors
     /// [`MoneyError::DivideByZero`] or [`MoneyError::Overflow`].
     pub fn div_int(self, n: i64) -> Result<Self> {
         if n == 0 {
