--- crates/velt-money/src/lib.rs
+++ replace Money::div_int -> Result<Self> with Ok(Default::default())
@@ -300,25 +300,17 @@
         })
     }
 
     /// Divide by an integer scalar, rounding half-away-from-zero.
     ///
     /// # Errors
     /// [`MoneyError::DivideByZero`] or [`MoneyError::Overflow`].
     pub fn div_int(self, n: i64) -> Result<Self> {
-        if n == 0 {
-            return Err(MoneyError::DivideByZero { op: "div_int" });
-        }
-        let minor = div_round_half_away(i128::from(self.minor), i128::from(n))?;
-        let minor = i64::try_from(minor).map_err(|_| MoneyError::Overflow { op: "div_int" })?;
-        Ok(Self {
-            minor,
-            currency: self.currency,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Express `self` as a rate of `base` in basis points.
     ///
     /// This is how every ratio metric in VELT (cap rate, cash-on-cash, DSCR) is
     /// produced: integer numerator over integer denominator, scaled to bps, with
     /// one rounding step.
     ///
