--- crates/velt-money/src/lib.rs
+++ replace Bps::raw -> i64 with 0
@@ -395,17 +395,17 @@
         pct.checked_mul(100).map(Self).ok_or(MoneyError::Overflow {
             op: "Bps::from_percent",
         })
     }
 
     /// The raw basis-point count.
     #[must_use]
     pub const fn raw(self) -> i64 {
-        self.0
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// True if strictly greater than zero.
     #[must_use]
     pub const fn is_positive(self) -> bool {
         self.0 > 0
     }
 
