--- crates/velt-money/src/lib.rs
+++ replace Bps::is_positive -> bool with true
@@ -401,17 +401,17 @@
     #[must_use]
     pub const fn raw(self) -> i64 {
         self.0
     }
 
     /// True if strictly greater than zero.
     #[must_use]
     pub const fn is_positive(self) -> bool {
-        self.0 > 0
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     /// Checked addition.
     ///
     /// # Errors
     /// [`MoneyError::Overflow`].
     /// Not `std::ops::Add`: that trait is infallible, and money addition here
     /// can fail on currency mismatch or overflow. Doctrine §5 forbids money
