--- crates/velt-money/src/lib.rs
+++ replace Bps::complement -> Result<Self> with Ok(Default::default())
@@ -439,17 +439,17 @@
             .ok_or(MoneyError::Overflow { op: "Bps::sub" })
     }
 
     /// The complement of this rate (`1 - self`), e.g. 1 - vacancy.
     ///
     /// # Errors
     /// [`MoneyError::Overflow`].
     pub fn complement(self) -> Result<Self> {
-        Self::ONE.sub(self)
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Divide this rate by an integer (e.g. an annual rate to monthly).
     ///
     /// # Errors
     /// [`MoneyError::DivideByZero`] or [`MoneyError::Overflow`].
     pub fn div_int(self, n: i64) -> Result<Self> {
         if n == 0 {
