--- crates/velt-money/src/lib.rs
+++ replace == with != in Bps::div_int
@@ -447,17 +447,17 @@
         Self::ONE.sub(self)
     }
 
     /// Divide this rate by an integer (e.g. an annual rate to monthly).
     ///
     /// # Errors
     /// [`MoneyError::DivideByZero`] or [`MoneyError::Overflow`].
     pub fn div_int(self, n: i64) -> Result<Self> {
-        if n == 0 {
+        if n != /* ~ changed by cargo-mutants ~ */ 0 {
             return Err(MoneyError::DivideByZero { op: "Bps::div_int" });
         }
         let raw = div_round_half_away(i128::from(self.0), i128::from(n))?;
         i64::try_from(raw)
             .map(Self)
             .map_err(|_| MoneyError::Overflow { op: "Bps::div_int" })
     }
 }
