--- crates/velt-money/src/lib.rs
+++ replace == with != in div_round_half_away
@@ -473,17 +473,17 @@
 }
 
 /// Integer division rounding half away from zero.
 ///
 /// The one rounding primitive in VELT. Half-away-from-zero is chosen over
 /// banker's rounding because it matches the convention lenders and HUD schedules
 /// use in published figures, so hand-verified fixtures agree to the cent.
 fn div_round_half_away(numer: i128, denom: i128) -> Result<i128> {
-    if denom == 0 {
+    if denom != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(MoneyError::DivideByZero {
             op: "div_round_half_away",
         });
     }
     // checked_div/checked_rem rather than `/` and `%`: i128::MIN / -1 overflows,
     // and doctrine §5 does not permit a financial path that can panic.
     let quot = numer.checked_div(denom).ok_or(MoneyError::Overflow {
         op: "div_round_half_away",
