--- crates/velt-money/src/lib.rs
+++ replace == with != in div_round_half_away
@@ -486,17 +486,17 @@
     // checked_div/checked_rem rather than `/` and `%`: i128::MIN / -1 overflows,
     // and doctrine §5 does not permit a financial path that can panic.
     let quot = numer.checked_div(denom).ok_or(MoneyError::Overflow {
         op: "div_round_half_away",
     })?;
     let rem = numer.checked_rem(denom).ok_or(MoneyError::Overflow {
         op: "div_round_half_away",
     })?;
-    if rem == 0 {
+    if rem != /* ~ changed by cargo-mutants ~ */ 0 {
         return Ok(quot);
     }
     let twice = rem.checked_mul(2).ok_or(MoneyError::Overflow {
         op: "div_round_half_away",
     })?;
     if twice.abs() >= denom.abs() {
         let step = if (numer < 0) == (denom < 0) { 1 } else { -1 };
         quot.checked_add(step).ok_or(MoneyError::Overflow {
