--- crates/velt-money/src/lib.rs
+++ replace Currency::exponent -> u32 with 0
@@ -74,19 +74,17 @@
 impl Currency {
     /// Number of decimal places in the currency's normal written form.
     ///
     /// All currencies currently supported are 2-exponent; the method exists so
     /// that adding a 0-exponent currency (JPY) or 3-exponent (KWD) is a data
     /// change rather than an audit of every call site.
     #[must_use]
     pub const fn exponent(self) -> u32 {
-        match self {
-            Self::Usd | Self::Eur | Self::Gbp | Self::Cad | Self::Mxn => 2,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Number of minor units in one major unit (100 for a 2-exponent currency).
     #[must_use]
     pub const fn minor_units_per_major(self) -> i64 {
         match self.exponent() {
             0 => 1,
             1 => 10,
