--- crates/velt-money/src/lib.rs
+++ replace Currency::minor_units_per_major -> i64 with 0
@@ -82,23 +82,17 @@
         match self {
             Self::Usd | Self::Eur | Self::Gbp | Self::Cad | Self::Mxn => 2,
         }
     }
 
     /// Number of minor units in one major unit (100 for a 2-exponent currency).
     #[must_use]
     pub const fn minor_units_per_major(self) -> i64 {
-        match self.exponent() {
-            0 => 1,
-            1 => 10,
-            2 => 100,
-            3 => 1_000,
-            _ => 1_000,
-        }
+        0 /* ~ changed by cargo-mutants ~ */
     }
 
     /// ISO-4217 alphabetic code.
     #[must_use]
     pub const fn code(self) -> &'static str {
         match self {
             Self::Usd => "USD",
             Self::Eur => "EUR",
