--- crates/velt-money/src/lib.rs
+++ delete match arm 2 in Currency::minor_units_per_major
@@ -85,17 +85,17 @@
     }
 
     /// Number of minor units in one major unit (100 for a 2-exponent currency).
     #[must_use]
     pub const fn minor_units_per_major(self) -> i64 {
         match self.exponent() {
             0 => 1,
             1 => 10,
-            2 => 100,
+             /* ~ changed by cargo-mutants ~ */
             3 => 1_000,
             _ => 1_000,
         }
     }
 
     /// ISO-4217 alphabetic code.
     #[must_use]
     pub const fn code(self) -> &'static str {
